
#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура КвизыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;

	Если Элемент.ТекущиеДанные.Завершен  Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Квиз уже завершен, выберите другой'"));	
		Возврат;	
	КонецЕсли;
	
	Объект.Квиз = ВыбраннаяСтрока;
	Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаАвторизации;
	
КонецПроцедуры

&НаКлиенте
Процедура КнопкаВойтиНажатие(Элемент)
	
	АвторизацияНаСервере();
	Если Не Объект.Команда.Пустая() Тогда
		ОткрытьФорму("Обработка.ИграВКвиз.Форма.ФормаКоманды", , ЭтотОбъект);
		ЭтотОбъект.Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВойтиВедущемуНажатие(Элемент)	
	
	ОткрытьФорму("Обработка.ИграВКвиз.Форма.ФормаВедущего", ,ЭтотОбъект);
	ЭтотОбъект.Закрыть();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Команда(Команда)
	ОткрытьФорму("Обработка.ИграВКвиз.Форма.ФормаКоманды");
	ЭтотОбъект.Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура Ведущий(Команда)
	ОткрытьФорму("Обработка.ИграВКвиз.Форма.ФормаВедущего");
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура АвторизацияНаСервере()

	Команда = Справочники.Квизы.КомандаКвизПоЛогину(Объект.Квиз, Логин);
	Если Команда.Пустая() Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Команда с таким логином не найдена'"));	
		Возврат;
	КонецЕсли;
	
	Если Справочники.Квизы.АвторизацияПройдена(Объект.Квиз, Логин, Пароль) Тогда
		Объект.Команда = Команда;	
	Иначе
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Пароль не верный'"));	
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
