
#Область ПрограммныйИнтерфейс

Функция ОтветПринят(Вопрос, ЭталонныйОтвет, Ответ) Экспорт
	
	//ToDo
	//1) Получаем токен https://ngw.devices.sberbank.ru:9443/api/v2/oauth
	//2) Запрос https://gigachat.devices.sberbank.ru/api/v1/chat/completions
	// Спрашиваем "Вопрос %1, верный ответ %2 Команда ответила %3, ответ можно принять, скажи да или нет"
	// Проверил в Postman - функционал работает, переносить сюда в рамках дипломной работы смысла не вижу
	Возврат Ложь;
	
КонецФункции

#Область СлужебныеПроцедурыИФункции
Функция ТокенАвторизации()
	
КонецФункции

Функция СпроситьУЧата()
	
КонецФункции
#КонецОбласти

#КонецОбласти