#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс
//todo поменять название на ЗаявкиНаИгру

Процедура ДобавитьЗаявкуНаИгру(Квиз, Команда) Экспорт
	
	Запись = СоздатьМенеджерЗаписи();
	Запись.Квиз = Квиз;
	Запись.Команда = Команда;
	Запись.Записать();
	
КонецПроцедуры

Процедура УдалитьЗаявкуНаИгру(Квиз, Команда) Экспорт
	
	Запись = РегистрыСведений.ЗаявкаНаИгру.СоздатьМенеджерЗаписи();
	Запись.Квиз = Квиз;
	Запись.Команда = Команда;
	Запись.Прочитать();
	Запись.Удалить();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
