
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

	ПроверкаВопросы = Вопросы.Выгрузить();
	ПроверкаВопросы.Свернуть("Вопрос");
	
	//Как вариант можно было бы выводить ошибки через накапливание в
	//ДобавитьОшибкуПользователю и после СообщитьОшибкиПользователю
	Если ПроверкаВопросы.Количество() <> Вопросы.Количество() Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru='Вопросы не должны повторяться'"),,,,Отказ);	
	КонецЕсли;

КонецПроцедуры

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");

#КонецЕсли