
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Процедура ЗафиксироватьОтветыКоманды(ОтветыНаВопросы) Экспорт
	
	Для Каждого Ответ Из ОтветыНаВопросы Цикл
		Запись = СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(Запись, Ответ);
		Запись.Записать();
	КонецЦикла;
	
КонецПроцедуры

#Область СлужебныеПроцедурыИФункции

Функция НовыйТаблицаОтвета() Экспорт
	
	Результат = Новый ТаблицаЗначений;
	КЧ = Новый КвалификаторыЧисла(10);
	КС = Новый КвалификаторыСтроки(150);

	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("Число"));
	МассивТипов.Добавить(Тип("Строка"));
	
	ОписаниеТиповОтвет = Новый ОписаниеТипов(МассивТипов, , КС, КЧ);
	
	Результат.Колонки.Добавить("Квиз", Новый ОписаниеТипов("СправочникСсылка.Квизы"));
	Результат.Колонки.Добавить("Команда", Новый ОписаниеТипов("СправочникСсылка.Команды"));
	Результат.Колонки.Добавить("Раунд", Новый ОписаниеТипов("СправочникСсылка.Раунды"));
	Результат.Колонки.Добавить("Вопрос", Новый ОписаниеТипов("СправочникСсылка.Вопросы"));
	Результат.Колонки.Добавить("Ответ", ОписаниеТиповОтвет);
	
	Возврат Результат;
	
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли
